app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 4], ["text", " dsd "], ["created_at", 2016-12-15 00:33:34 UTC], ["updated_at", 2016-12-15 00:33:34 UTC]]
---
  def create
  	@post = Post.find(params[:post_id])
  	@comment = @post.comments.build(params[:text])
  	@comment.text=params[ "prueba" ]
  	@comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_comment
      @post = Post.find(params[:id])